import pyperclip
import uuid

def copy_to_clipboard(text):
    pyperclip.copy(text)

def generate_unique_url(base_url="https://sport-recommender-ai.streamlit.app", user_id=None):
    if not user_id:
        user_id = str(uuid.uuid4())
    return f"{base_url}?user={user_id}"

questions = [
    {"question": "ما هو هدفك الأساسي من ممارسة الرياضة؟", "options": ["تحسين اللياقة العامة", "بناء عضلات", "المتعة والتسلية", "المنافسة والتحدي", "تقليل التوتر وتحسين المزاج"]},
    {"question": "أي من البيئات تفضل التدريب فيها؟", "options": ["في الهواء الطلق", "في صالة رياضية", "في الماء", "في الطبيعة", "لا فرق"]},
    {"question": "كيف تصف مستوى نشاطك اليومي؟", "options": ["نشط جدًا", "نشط أحيانًا", "كسول نسبيًا", "لا أمارس نشاطًا أبدًا"]},
    {"question": "ما مدى تقبلك للتحديات البدنية القاسية؟", "options": ["أحبها جدًا", "لا أمانع", "أفضل الرياضات الخفيفة", "لا أحب التعب البدني"]},
    {"question": "هل تستمتع بالرياضات الفردية أم الجماعية؟", "options": ["فردية", "جماعية", "الاثنين", "لست متأكدًا"]},
    {"question": "هل تفضل السرعة والانفجار أو التحمل والبطء؟", "options": ["السرعة والانفجار", "التحمل والبطء", "مزيج بينهما", "حسب المزاج"]},
    {"question": "هل تعتبر نفسك مغامرًا؟", "options": ["نعم جدًا", "إلى حد ما", "لا", "لا أعرف"]},
    {"question": "ما أكثر ما يجذبك في الرياضة؟", "options": ["الإثارة", "الروتين", "النتائج", "التفاعل الاجتماعي", "المتعة"]},
    {"question": "كم من الوقت يمكنك تخصيصه للرياضة أسبوعيًا؟", "options": ["أقل من 3 ساعات", "3-5 ساعات", "6-10 ساعات", "أكثر من 10 ساعات"]},
    {"question": "هل تهتم بتعلم مهارات جديدة؟", "options": ["نعم دائمًا", "أحيانًا", "نادراً", "لا"]},
    {"question": "هل تحب الرياضات التي فيها احتكاك جسدي؟", "options": ["نعم", "لا", "حسب نوع الرياضة"]},
    {"question": "هل تفضل التدريب بمعدات أم باستخدام وزن الجسم؟", "options": ["بمعدات", "وزن الجسم", "الاثنين", "لا أعلم"]},
    {"question": "هل تحب الرياضات التنافسية؟", "options": ["نعم", "أحيانًا", "لا"]},
    {"question": "كيف تصف شخصيتك؟", "options": ["انطوائي", "اجتماعي", "متحول حسب الموقف"]},
    {"question": "هل يهمك الجانب الجمالي (المظهر الجسدي) من الرياضة؟", "options": ["نعم جدًا", "إلى حد ما", "لا يهم"]},
    {"question": "هل لديك إصابات أو قيود بدنية؟", "options": ["نعم", "لا", "أحيانًا"]},
    {"question": "هل تحب السفر أو التنقل من أجل الرياضة؟", "options": ["نعم", "لا", "أحيانًا"]},
    {"question": "هل تفضل التمارين القصيرة والمكثفة أم الطويلة والخفيفة؟", "options": ["قصيرة ومكثفة", "طويلة وخفيفة", "حسب الوقت المتاح"]},
    {"question": "هل تحب التحديات العقلية؟", "options": ["نعم", "أحيانًا", "لا"]},
    {"question": "هل تعتبر الرياضة هوية لك؟", "options": ["نعم", "لا", "أحاول أن أجعلها كذلك"]},
]